Revit 2026 API

# TypeBinding(CategorySet) Constructor

---

Constructs a type binding with the set of categories passed.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TypeBinding(
	CategorySet categories
)
```
```vb
Public Sub New (
	categories As CategorySet
)
```
```cpp
public:
TypeBinding(
	CategorySet^ categories
)
```
```fsharp
new :
        categories : CategorySet -> TypeBinding
```

#### Parameters

categories CategorySet

Categories can be set or changed at a later time by using the Categories property of this object.

#### Reference

TypeBinding Class

TypeBinding Overload

Autodesk.Revit.DB Namespace